# Optional Functionality Utils Is Shape Importer Available Method

Source: https://www.revitapidocs.com/2026/1b876c5c-c873-7347-efb9-280fa827b325.htm

---

| Optional Functionality Utils Is Shape Importer Available Method |
| --- |

Checks whether the ShapeImporter functionality and Material Library are available in the installed Revit.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static bool IsShapeImporterAvailable()
```

```
Public Shared Function IsShapeImporterAvailable As Boolean
```

```
public:
static bool IsShapeImporterAvailable()
```

```
static member IsShapeImporterAvailable : unit -> bool
```

#### Return Value

Boolean
True if the ShapeImporter functionality and Material Library are available in the installed Revit. See Also

#### Reference

OptionalFunctionalityUtils Class Autodesk.Revit.DB Namespace